{
  "buildings": [
    {
      "id": "sagrada-familia",
      "title": "Sagrada Familia",
      "location": "Barcelona, Spain",
      "architect": "Antoni Gaudí",
      "yearBuilt": 1882,
      "yearCompleted": null,
      "style": ["Modernisme", "Art Nouveau"],
      "region": "Europe",
      "category": "Religious",
      "era": "Modern",
      "description": "An iconic basilica and UNESCO World Heritage Site, the Sagrada Familia represents the pinnacle of Catalan Modernism. Gaudí's masterpiece combines Gothic and Art Nouveau forms, featuring nature-inspired designs and intricate facades that tell biblical stories through stone.",
      "fullStory": "The Sagrada Familia stands as Barcelona's most iconic landmark and Antoni Gaudí's magnum opus. Construction began in 1882, and remarkably, it continues to this day—making it one of the world's longest-running architectural projects. Gaudí devoted the last 15 years of his life exclusively to this project, living on-site and pouring his visionary genius into every detail.\n\nThe basilica's design is revolutionary, blending Gothic traditions with organic, nature-inspired forms. Three grand facades represent the birth, passion, and glory of Christ. The Nativity Facade, the only one completed during Gaudí's lifetime, showcases his characteristic style with its flowing forms and intricate sculptural details.\n\nInside, the forest-like columns branch toward the ceiling like trees, creating a canopy of stone that filters colored light through stained glass windows. This wasn't mere aesthetics—Gaudí studied natural structures to create columns that could support immense weight while appearing delicate and organic.\n\nWhen completed (projected for 2026, the centenary of Gaudí's death), the Sagrada Familia will feature 18 towers. The central tower, representing Jesus Christ, will stand 172.5 meters tall—deliberately one meter shorter than Montjuïc hill, as Gaudí believed human creation should never surpass God's.\n\nThe basilica represents more than architectural innovation; it's a spiritual journey rendered in stone, a testament to human perseverance, and a bridge between the 19th and 21st centuries.",
      "mainImage": "images/buildings/sagrada-familia-main.jpg",
      "gallery": [
        "images/buildings/sagrada-familia-1.jpg",
        "images/buildings/sagrada-familia-2.jpg",
        "images/buildings/sagrada-familia-3.jpg"
      ],
      "tags": ["UNESCO", "Basilica", "Under Construction"],
      "relatedBuildings": ["casa-batllo", "park-guell"],
      "featuredOnHomepage": true
    },
    {
      "id": "colosseum",
      "title": "The Colosseum",
      "location": "Rome, Italy",
      "architect": "Vespasian & Titus",
      "yearBuilt": 70,
      "yearCompleted": 80,
      "style": ["Roman"],
      "region": "Europe",
      "category": "Historical",
      "era": "Ancient",
      "description": "The largest amphitheater ever built, the Colosseum is an enduring symbol of Imperial Rome's architectural and engineering prowess. This massive stone structure could hold up to 80,000 spectators and featured complex systems for staging elaborate spectacles.",
      "fullStory": "The Colosseum, originally known as the Flavian Amphitheatre, represents the zenith of Roman engineering and architectural achievement...",
      "mainImage": "images/buildings/colosseum-main.jpg",
      "gallery": [
        "images/buildings/colosseum-1.jpg",
        "images/buildings/colosseum-2.jpg"
      ],
      "tags": ["UNESCO", "Ancient Rome", "Amphitheater"],
      "relatedBuildings": ["pantheon", "roman-forum"],
      "featuredOnHomepage": false
    },
    {
      "id": "taj-mahal",
      "title": "Taj Mahal",
      "location": "Agra, India",
      "architect": "Ustad Ahmad Lahauri",
      "yearBuilt": 1632,
      "yearCompleted": 1653,
      "style": ["Mughal", "Islamic"],
      "region": "Asia",
      "category": "Historical",
      "era": "Medieval",
      "description": "A magnificent white marble mausoleum commissioned by Mughal Emperor Shah Jahan for his beloved wife. The Taj Mahal exemplifies Mughal architecture's fusion of Persian, Islamic, and Indian styles, creating perfect symmetry and ethereal beauty.",
      "fullStory": "The Taj Mahal stands as the world's most recognizable monument to love...",
      "mainImage": "images/buildings/taj-mahal-main.jpg",
      "gallery": [],
      "tags": ["UNESCO", "Mausoleum", "Marble"],
      "relatedBuildings": [],
      "featuredOnHomepage": false
    },
    {
      "id": "burj-khalifa",
      "title": "Burj Khalifa",
      "location": "Dubai, UAE",
      "architect": "Adrian Smith (SOM)",
      "yearBuilt": 2004,
      "yearCompleted": 2010,
      "style": ["Neo-futurism", "Islamic"],
      "region": "Asia",
      "category": "Modern",
      "era": "Contemporary",
      "description": "The world's tallest building at 828 meters, Burj Khalifa redefines the possibilities of vertical architecture. Its Y-shaped plan maximizes views of the Arabian Gulf while reducing wind forces, demonstrating how form and function unite in supertall design.",
      "fullStory": "Rising from the Dubai desert like a modern ziggurat, Burj Khalifa represents humanity's latest achievement in vertical construction...",
      "mainImage": "images/buildings/burj-khalifa-main.jpg",
      "gallery": [],
      "tags": ["Skyscraper", "Record-breaking", "Modern"],
      "relatedBuildings": [],
      "featuredOnHomepage": false
    },
    {
      "id": "guggenheim-bilbao",
      "title": "Guggenheim Museum Bilbao",
      "location": "Bilbao, Spain",
      "architect": "Frank Gehry",
      "yearBuilt": 1991,
      "yearCompleted": 1997,
      "style": ["Deconstructivism"],
      "region": "Europe",
      "category": "Museums",
      "era": "Contemporary",
      "description": "Frank Gehry's titanium-clad masterpiece transformed Bilbao from an industrial port into a cultural destination. Its sculptural, flowing forms challenge traditional notions of architecture, creating spaces that blur the line between building and artwork.",
      "fullStory": "The Guggenheim Museum Bilbao represents one of the most significant architectural achievements of the late 20th century...",
      "mainImage": "images/buildings/guggenheim-main.jpg",
      "gallery": [],
      "tags": ["Museum", "Titanium", "Contemporary"],
      "relatedBuildings": [],
      "featuredOnHomepage": false
    },
    {
      "id": "sydney-opera-house",
      "title": "Sydney Opera House",
      "location": "Sydney, Australia",
      "architect": "Jørn Utzon",
      "yearBuilt": 1959,
      "yearCompleted": 1973,
      "style": ["Expressionist", "Modern"],
      "region": "Oceania",
      "category": "Modern",
      "era": "Modern",
      "description": "One of the most recognizable buildings of the 20th century, featuring distinctive shell-shaped sails that seem to float on Sydney Harbor. Utzon's visionary design pushed engineering boundaries and created an international icon of modern architecture.",
      "fullStory": "The Sydney Opera House's distinctive silhouette has become synonymous with Australia itself...",
      "mainImage": "images/buildings/sydney-opera-main.jpg",
      "gallery": [],
      "tags": ["UNESCO", "Performing Arts", "Modern"],
      "relatedBuildings": [],
      "featuredOnHomepage": false
    }
  ]
}
